tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/filmRegion/Tf
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{

    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/filmRegion";
    object      Tf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  298;

boundaryField
{
    region0_to_filmRegion_coupledWall // Patch to pyrolysis
    {
        type            mappedField;
        sampleRegion    pyrolysisRegion;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_pyrolysisRegion_coupledWall;
        offset          (0 0 0);
        field       T;
        setAverage      no;
        average         0;
        value           uniform 298;
    }

    coupledWall_top // Patch to Region0
    {
        type            zeroGradient;
    }

    "side.*"
    {
        type            inletOutlet;
        inletValue      uniform 298;
        value           uniform 298;
    }

    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 298.0;
    }
}

// ************************************************************************* //
