tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/ph_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    side
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    ground
    {
        type            fixedFluxPressure;
    }

    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
